Revit 2017 API
AssetPropertyDoubleArray3d Class
 Represents a property consisting of an array of double values.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyDoubleArray3d : AssetProperty
Visual Basic
Public Class AssetPropertyDoubleArray3d _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDoubleArray3d : public AssetProperty
Remarks
 In virtually all cases, the array will contain exactly 3 values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyDoubleArray3d
See Also
AssetPropertyDoubleArray3d Members
Autodesk.Revit.Utility Namespace